Autodesk.Revit.DB.FabricationItemFolder.GetItemFiles
Gets the item files in this item folder.
Since:
2019

Autodesk.Revit.DB.FabricationItemFolder.GetSubFolders
Gets the item folder's sub folders.
Since:
2019

Autodesk.Revit.DB.FabricationItemFolder.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FabricationItemFolder.Name
The item folder's name.
Since:
2019

Autodesk.Revit.DB.FabricationItemFolder
A fabrication item folder that can contain sub folders and access to the Autodesk.Revit.DB.FabricationItemFiles contained within.
Since:
2019